# SetElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..SetElementIds Method
SelectionFilterElement Class See Also
---
Replaces the set of ElementIds contained by this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetElementIds(
	ICollection<ElementId> ids
)
```

Visual Basic
---
```text
Public Sub SetElementIds ( _
	ids As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetElementIds(
	ICollection<ElementId^>^ ids
)
```

# ### Parameters
ids
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The new set of ElementIds.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace